---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCGeometryInfo
source: html/7a58e388-ad3c-8304-f967-6db71fb83ea3.htm
---
# IFCGeometryInfo Methods

Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.